Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The projection class needs to be a valid Java Bean and have a constructor that contains all its attributes, this constructor will be used to instantiate the projection DTO instead of using the entity class. This class must have a matching constructor with all the class attributes as parameters.
ja_jp: 射影クラスは、有効な Java Bean であり、すべての属性を含むコンストラクタを持つ必要があります。このコンストラクタは、エンティティクラスを使用する代わりに、射影のDTOをインスタンス化するために使用されます。このクラスは、すべてのクラス属性をパラメータとして持つ一致するコンストラクタを持つ必要があります。

source: The projection class needs to be a valid Java Bean and have a constructor that contains all its attributes, this constructor will be used to instantiate the projection DTO instead of using the entity class. This must be the only constructor of the class.
ja_jp: 射影クラスは、有効な Java Bean であり、すべての属性を含むコンストラクタを持つ必要があります。このコンストラクタは、エンティティクラスを使用する代わりに、射影のDTOをインスタンス化するために使用されます。このクラスは、すべてのクラス属性をパラメータとして持つ一致するコンストラクタを持つ必要があります。

source: The projection class needs to have a constructor that contains all its attributes, this constructor will be used to instantiate the projection DTO instead of using the entity class. This class must have a matching constructor with all the class attributes as parameters.
ja_jp: 射影クラスは、すべての属性を含むコンストラクタを持つ必要があります。このコンストラクタは、エンティティクラスを使用する代わりに、射影のDTOをインスタンス化するために使用されます。このクラスは、すべてのクラス属性をパラメータとして持つコンストラクタを持つ必要があります。

source: The promise of "cheap blocking" might not always hold: a virtual thread might _pin_ its carrier on certain occasions. The platform thread is blocked in this situation, precisely as it would have been in a typical blocking scenario.
ja_jp: 「安価なブロッキング」の約束は常に成り立つわけではありません。仮想スレッドは特定の状況でそのキャリアーを _ピン_ することがあります。 この場合、プラットフォームスレッドはブロックされ、通常のブロッキングシナリオと同様に動作します。

source: The proper solution is to increase the entropy available for the system. That is specific for each OS vendor and virtualization solution though.
ja_jp: 適切な解決策は、システムで利用可能なエントロピーを増やすことです。それはOSベンダーや仮想化ソリューションごとに固有な方法を必要とします。

source: The properties are shown below:
ja_jp: プロパティーは以下の通りです:

source: The properties artifact itself is expected to be a traditional `properties` file that will be loaded into an instance of `java.util.Properties` class.
ja_jp: プロパティ・アーティファクト自体は、 `java.util.Properties` クラスのインスタンスにロードされる伝統的な `properties` ファイルであることが期待されます。

source: The properties at the root of the `quarkus.hibernate-orm.` namespace define the default persistence unit. For instance, the following snippet defines a default datasource and a default persistence unit:
ja_jp: `quarkus.hibernate-orm.` 名前空間のルートにあるプロパティーで、デフォルトの永続化ユニットを定義します。 たとえば、次のスニペットではデフォルトのデータソースとデフォルトの永続化ユニットを定義しています:

source: The properties at the root of the `quarkus.hibernate-search-orm.` namespace define the default persistence unit. For instance, the following snippet defines a default datasource and a default persistence unit, and sets the Elasticsearch host for that persistence unit to `es1.mycompany.com:9200`.
ja_jp: `quarkus.hibernate-search-orm.` 名前空間のルートにあるプロパティは、デフォルトの永続化ユニットを定義します。たとえば、次のスニペットでは、デフォルトのデータソースとデフォルトの永続化ユニットを定義し、その永続化ユニットのElasticsearchホストを `es1.mycompany.com:9200` に設定しています。

source: The properties files realm supports mapping of users to password and users to roles with a combination of properties files. They are configured with properties starting with `quarkus.security.users.file`.
ja_jp: プロパティーファイルのレルムは、プロパティーファイルの組み合わせを使用して、ユーザーをパスワードに、ユーザーをロールにマッピングすることをサポートしています。これらは `quarkus.security.users.file` で始まるプロパティーで構成されています。

source: The properties files realm supports the mapping of users to passwords and users to roles with a combination of properties files. They are configured with properties starting with `quarkus.security.users.file`.
ja_jp: プロパティファイルレルムは、プロパティファイルの組み合わせにより、ユーザーをパスワードに、ユーザーをロールにマッピングすることをサポートしています。これらは、 `quarkus.security.users.file` で始まるプロパティで設定されます。

source: The properties fixed at build time are marked with a lock icon (icon:lock[]) in the xref:all-config.adoc[list of all configuration options].
ja_jp: ビルド時に固定されたプロパティーは、 link:all-config[すべての設定オプションのリスト] でロックアイコン (icon:lock[]) でマークされます。

source: The properties for configuring `docker` and `s2i` are also deprecated in favor of the new container-image extensions.
ja_jp: `docker` と `s2i` を設定するためのプロパティーも非推奨となり、新しいコンテナーイメージエクステンションが採用されました。

source: The properties obtained from the ConfigMaps and Secrets have a higher priority than (i.e. they override) any properties of the same name that are found in `application.properties` (or the YAML equivalents), but they have lower priority than properties set via Environment Variables or Java System Properties.
ja_jp: ConfigMapsとSecretsから取得したプロパティーは、 `application.properties` (またはYAMLの等価物)にある同名のプロパティーよりも高い優先度を持っています(すなわち、それらは上書きされます)が、環境変数やJavaシステムプロパティーを介して設定されたプロパティーよりも優先度は低くなります。

source: The properties on a Web component page is scope for that page/webcomponent. There is also a few global states available that might be useful in your component. Dev UI uses https://gitaarik.github.io/lit-state/build/[LitState] for this. LitState automatically re-renders your LitElement components, when a shared app state variable they use changes. It's like LitElement's properties, but then shared over multiple components.
ja_jp: Web コンポーネントページのプロパティーは、そのページ/Web コンポーネントのスコープです。コンポーネントで役立つ可能性のあるいくつかのグローバルな状態も利用できます。Dev UI はこの目的のために https://gitaarik.github.io/lit-state/build/[LitState] を使用します。LitState は、使用している共有アプリケーション状態変数が変更されると、LitElement コンポーネントを自動的に再レンダリングします。これは LitElement のプロパティーに似ていますが、複数のコンポーネントで共有されます。

source: The property `quarkus.jaxb.exclude-classes` accepts a comma separated list of either fully qualified class names or package names. Package names must be suffixed by `.*` and all classes in the specified package and its subpackages will be excluded.
ja_jp: `quarkus.jaxb.exclude-classes` プロパティは、完全修飾クラス名またはパッケージ名 のコンマ区切りリスト を使用できます。 パッケージ名を指定する場合は、末尾に `.*` を付ける必要があり、指定されたパッケージおよびそのサブパッケージ内のすべてのクラスが除外されます。

source: The property `quarkus.liquibase-mongodb.[MongoDB client name].change-log` is the minimal configuration required for the extension to detect a new client setup.
ja_jp: プロパティー `quarkus.liquibase-mongodb.[MongoDB client name].change-log` は、エクステンションが新しいクライアント設定を検出するために必要な最小限の設定です。

source: The property is also honored when running tests:
ja_jp: このプロパティーは、テストを実行するときにも尊重されます。

source: The property value could be either an absolute path, such as `/home/foo/dump` on a Linux machine, or a path relative to the user working directory, i.e. `dump` corresponds to the `{user.dir}/target/dump` in the dev mode and `{user.dir}/dump` when running the tests.
ja_jp: プロパティー値は、Linux マシンの `/home/foo/dump` などの絶対パス、またはユーザーの作業ディレクトリーからの相対パスになります。つまり、 `dump` は開発モードの `{user.dir}/target/dump` やテスト実行時の `{user.dir}/dump` に対応します。

source: The provided replicas <1>, labels <2> and environment variables <3> were retained. However, the image <4> and container port <5> were modified. Moreover, the default annotations have been added.
ja_jp: 提供されたレプリカ <1>, ラベル <2>, 環境変数 <3> はそのまま引き継がれました。ただし、イメージ <4> とコンテナーポート <5> は変更されました。また、デフォルトのアノテーションが追加されました。

source: The provided replicas,
ja_jp: 提供されたレプリカ

source: The provided solution contains a few additional elements such as tests and testing infrastructure.
ja_jp: 提供されるソリューションには、テストやテストのインフラストラクチャなど、いくつかの追加要素が含まれています。

source: The provider needs to implement `ServiceDiscoveryType` typed by the configuration class.
ja_jp: プロバイダーは、設定クラスで型付けされた `ServiceDiscoveryType` を実装する必要があります。

source: The provider needs to implement `ServiceDiscoveryType` typed by the configuration class. This configuration class is generated automatically by the Configuration Generator. Its name is created by appending `Configuration` to the service discovery type, such as `AcmeConfiguration`.
ja_jp: プロバイダは、設定クラスによって型付けされた `ServiceDiscoveryType` を実装する必要があります。この設定クラスは、Configuration Generatorによって自動的に生成されるます。その名前は、 `AcmeConfiguration` のように，サービスディスカバリー型に `Configuration` を付加して作成されます。

source: The proxy host
ja_jp: プロキシーホスト

source: The proxy port
ja_jp: プロキシーポート

source: The proxy type. Possible values are `HTTP` (default), `SOCKS4`, and `SOCKS5`.
ja_jp: プロキシータイプ。可能な値は `HTTP` (デフォルト)、`SOCKS4`、および `SOCKS5` です。

source: The purpose of Funqy is to allow you to write cross-provider functions so that you can move off of your current function provider if, for instance, they start charging you a lot more for their service. Another reason you might not want to use Funqy is if you need access specific APIs of the target function environment. For example, developers often want access to the AWS Context on Lambda. In this case, we tell them they may be better off using the xref:amazon-lambda.adoc[Quarkus Amazon Lambda] integration instead.
ja_jp: Funqy の目的は、プロバイダーを跨いだファンクションを書けるようにすることであり、例えば、現在のファンクションプロバイダーの利用料金が上昇してしまった場合に、そこから移動できるようにすることです。対象のファンクション実行環境の特定の API にアクセスする必要がある場合は、Funqy を使わない理由となり得ます。よくある例としては、開発者が Lambda で AWS Context にアクセスしたい場合です。この場合は、代わりに xref:amazon-lambda.adoc[Quarkus Amazon Lambda] による統合を使用した方が良い場合があります。

source: The purpose of Funqy is to allow you to write cross-provider functions so that you can move off of your current function provider if, for instance, they start charging you a lot more for their service. Another reason you might not want to use Funqy is if you need access specific APIs of the target function environment. For example, developers often want access to the AWS Context on Lambda. In this case, we tell them they may be better off using the xref:aws-lambda.adoc[Quarkus AWS Lambda] integration instead.
ja_jp: Funqyの目的は、クロスプロバイダー関数を書けるようにすることで、例えば、現在の関数プロバイダーが高額な料金を請求するようになった場合、そのプロバイダーから移ることができるようにすることです。 Funqyを使いたくないもう一つの理由として、ターゲット関数環境の特定のAPIにアクセスする必要がある場合もあるでしょう。例えば、開発者はLambdaのAWS Contextにアクセスしたいことがよくあります。この場合、代わりに xref:aws-lambda.adoc[QuarkusのAWS Lambda] インテグレーションを使用する方がよいかもしれません。

source: The purpose of `@IndexedEmbedded` is to include the `Book` fields into the `Author` index. In this case, we just use the default configuration: all the fields of the associated `Book` entities are included in the index (i.e. the `title` field). The nice thing with `@IndexedEmbedded` is that it is able to automatically reindex an `Author` if one of its ``Book``s has been updated thanks to the bidirectional relation. `@IndexedEmbedded` also supports nested documents (using the `storage = NESTED` attribute) but we don't need it here. You can also specify the fields you want to include in your parent index using the `includePaths` attribute if you don't want them all.
ja_jp: `@IndexedEmbedded` の目的は、 `Book` フィールドを `Author` インデックスに含めることです。 この場合、デフォルトの設定を使用します：関連する `Book` エンティティのすべてのフィールドがインデックスに含まれます（つまり、 `title` フィールド）。 `@IndexedEmbedded` の良いところは、双方向関係のおかげで、 `Book` のいずれかが更新された場合、 `Author` のインデックスを自動的に再作成できることです。 `@IndexedEmbedded` も入れ子ドキュメントをサポートしていますが（ `storage = NESTED` 属性を使用）、ここでは必要ありません。全てのフィールドを必要としない場合、 `includePaths` 属性を使って親インデックスに含めたいフィールドを指定することもできます。

source: The purpose of `@IndexedEmbedded` is to include the `Book` fields into the `Author` index. In this case, we just use the default configuration: all the fields of the associated `Book` entities are included in the index (i.e. the `title` field). The nice thing with `@IndexedEmbedded` is that it is able to automatically reindex an `Author` if one of its ``Book``s has been updated thanks to the bidirectional relation. `@IndexedEmbedded` also supports nested documents (using the `storage = NESTED` attribute), but we don't need it here. You can also specify the fields you want to include in your parent index using the `includePaths` attribute if you don't want them all.
ja_jp: `@IndexedEmbedded` の目的は `Book` のフィールドを `Author` のインデックスに含めることです。この場合はデフォルトの設定を使用します。つまり、関連する `Book` エンティティのすべてのフィールドがインデックスに含まれます (つまり `title` フィールドも含まれます)。 `@IndexedEmbedded` の優れた点は双方向の関係により `Book` のいずれかが更新された場合も `Author` のインデックスを自動的に再作成できることです。 `@IndexedEmbedded` は、入れ子になったドキュメントもサポートしていますが（ `storage = NESTED` 属性を使用）ここでは必要ありません。また、すべてのフィールドを親インデックスに含める必要のない場合は、 `includePaths` 属性を使って含めるフィールドを指定することができます。

source: The purpose of `@IndexedEmbedded` is to include the `Book` fields into the `Author` index. In this case, we just use the default configuration: all the fields of the associated `Book` entities are included in the index (i.e. the `title` field). The nice thing with `@IndexedEmbedded` is that it is able to automatically reindex an `Author` if one of its ``Book``s has been updated thanks to the bidirectional relation. `@IndexedEmbedded` also supports nested documents (using the `structure = NESTED` attribute), but we don't need it here. You can also specify the fields you want to embed in your parent index using the `includePaths`/`excludePaths` attributes if you don't want them all.
ja_jp: `@IndexedEmbedded` の目的は、 `Book` のフィールドを `Author` のインデックスに含めることです。この場合はデフォルトの設定を使用します。つまり、関連する `Book` エンティティーのすべてのフィールドがインデックスに含まれます (つまり `title` フィールドも含まれます)。 `@IndexedEmbedded` の優れた点は双方向の関係により `Book` のいずれかが更新された場合も `Author` のインデックスを自動的に再作成できることです。 `@IndexedEmbedded` は、ネストされたドキュメントもサポートしていますが (`structure = NESTED` 属性を使用) ここでは必要ありません。また、すべてのフィールドを親インデックスに組み込む必要がない場合は、 `includePaths`/`excludePaths` 属性を使用して含めるフィールドを指定できます。

source: The purpose of `@IndexedEmbedded` is to include the `Book` fields into the `Author` index. In this case, we just use the default configuration: all the fields of the associated `Book` instances are included in the index (i.e. the `title` field). `@IndexedEmbedded` also supports nested documents (using the `structure = NESTED` attribute), but we don't need it here. You can also specify the fields you want to embed in your parent index using the `includePaths`/`excludePaths` attributes if you don't want them all.
ja_jp: `@IndexedEmbedded` の目的は、 `Book` フィールドを `Author` インデックスに含めることです。 この場合は、デフォルトの設定を使用します。つまり、関連付けられている `Book` インスタンスのすべてのフィールド (つまり `title` フィールド) がインデックスに含まれます。 `@IndexedEmbedded` はネストされたドキュメントもサポート (`structure = NESTED` 属性を使用) しますが、ここでは必要ありません。 また、すべてのフィールドを親インデックスに含める必要がない場合は、 `includePaths`/`excludePaths` 属性を使用して含めるフィールドを指定することができます。

source: The purpose of the annotations in the code above is the following:
ja_jp: 上のコードのアノテーションの目的は以下の通りです。

source: The purpose of this blog post is to clear up some confusion about RESTEasy Reactive and answer some commonly asked questions around it.
ja_jp: このブログ記事の目的は、RESTEasy Reactive についての混乱を解消し、よくある質問に答えることです。

source: The purpose of this extension is to generate Kubernetes manifests (`kind.yaml` and `kind.json`) that are tailored to Kind and also to automate the process of loading images to the cluster when performing container image builds. The tailor made manifests will be pretty similar (they share the same rules) with Minikube (see above).
ja_jp: このエクステンションの目的は、Kind に合わせた Kubernetes マニフェスト (`kind.yaml` と `kind.json`) を生成することと、コンテナーイメージのビルドを行う際にクラスターにイメージをロードする処理を自動化することにあります。テーラーメードのマニフェストは、Minikube (上記を参照) と非常によく似ています (同じルールを共有)。

source: The purpose of this extension is to generate Kubernetes manifests (`minikube.yaml` and `minikube.json`) that are tailored to Minikube. This extension assumes a couple of things:
ja_jp: このエクステンションの目的は、Minikube に合わせた Kubernetes マニフェスト (`minikube.yaml` および `minikube.json`) を生成することです。このエクステンションは、いくつかのことを前提としています。

source: The purpose of this extension is to generate Kubernetes manifests (`minikube.yaml` and `minikube.json`) that are tailored to Minikube. This extension assumes a couple things:
ja_jp: このエクステンションの目的は、Minikube に合わせた Kubernetes マニフェスト (`minikube.yaml` と `minikube.json`) を生成することです。 このエクステンションはいくつかのことを前提としています。

source: The qualifiers of a bean are declared by annotating the bean class or producer method or field with the qualifier types:
ja_jp: Beanの修飾子は、Beanクラスやプロデューサのメソッドやフィールドに修飾子タイプをアノテーションすることで宣言されます。

source: The quarkus-narayana-jta extension provides a Transaction Manager that coordinates and expose transactions to your applications as described in the link: Jakarta Transactions specification, formerly known as Java Transaction API (JTA).
ja_jp: quarkus-narayana-jtaエクステンションは、リンク先で説明されているように、トランザクションを調整し、アプリケーションに公開するトランザクションマネージャを提供します：Jakarta Transactions仕様（旧称Java Transaction API (JTA)）。

source: The quarkus-websockets-next extension provides a modern declarative API to define WebSocket server and client endpoints.
ja_jp: quarkus-websockets-nextエクステンションは、WebSocketサーバーとクライアントのエンドポイントを定義するための最新の宣言型APIを提供します。

source: The query embedding is used in a "Similarity Search" against the "Vector Store" to retrieve relevant document chunks. The "Vector Store" "serves" the similarity search.
ja_jp: クエリの埋め込みは、「Vector Store」に対する「Similarity Search」で使用され、関連するドキュメントチャンクを取得します。「Vector Store」は類似性検索を「提供」します。

source: The question, now, is how far are we from a _regular_ Quarkus application? Quite close, actually. The equivalent application using RESTEasy Reactive would be something like:
ja_jp: 問題は、Quarkusの _通常の_アプリケーションからどれくらい離れているかということです。実際には、かなり近いです。RESTEasy Reactiveを使った同等のアプリケーションは、次のようなものです:

source: The queue from which messages are consumed. Type: _string_
ja_jp: メッセージが消費されるキュー。 Type: _string_

source: The quickstart works by manually sending an HTTP request containing a Cloud Event to the Knative Broker using `curl`. The Knative Broker receives the request and triggers the startup of the Funqy container built by the quickstart. The event triggers the invocation of a chain of Funqy functions. The output of one function triggers the invocation of another Funqy function.
ja_jp: クイックスタートは、Cloud Eventを含む HTTP リクエストを `curl` を使用して Knative Broker に手動で送信することで動作します。Knative Broker はリクエストを受信し、クイックスタートによって構築された Funqy コンテナの起動をトリガーします。イベントは、一連の Funqy 関数の呼び出しをトリガーします。1 つの関数の出力は、別の Funqy 関数の呼び出しをトリガーします。

source: The quotes shown in the property name are required as categories normally contain '.' which must be escaped. An example is shown in <<category-example>>.
ja_jp: カテゴリには通常 '.' が含まれているため、プロパティー名に表示されているクオートはエスケープされている必要があります。例を link:#category-example[[category-example]] に示します。

source: The random port can be found with `docker ps`
ja_jp: ランダムポートは `docker ps` で確認できます。

source: The random port is `49174`.
ja_jp: ランダムポートは `49174` です。

source: The reactive API of MongoDB with Panache uses Mutiny reactive types. If you are not familiar with Mutiny, check xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library].
ja_jp: MongoDB with PanacheのリアクティブAPIは、Mutinyのリアクティブ型を使用しています。Mutinyに慣れていない方は、 link:mutiny-primer.html[MUTINYによる非同期入門] をご覧ください。

source: The reactive API of the MongoDB with Panache uses Mutiny reactive types. If you are not familiar with Mutiny, check xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library].
ja_jp: MongoDB with PanacheのリアクティブAPIは、Mutinyのリアクティブ型を使用しています。Mutinyに慣れていない方は、 link:mutiny-primer.html[Mutiny - an intuitive reactive programming library]をご覧ください。

source: The reactive PostgreSQL and MariaDB/MySQL clients support defining several connections.
ja_jp: リアクティブPostgreSQLおよびMariaDB/MySQLクライアントは、複数の接続を定義することをサポートしています。

source: The reactive SQL clients support defining several datasources.
ja_jp: Reactive SQL クライアントは、複数のデータソースの定義をサポートしています。

source: The reactive SQL clients support transactions. A transaction is started with `io.vertx.mutiny.sqlclient.SqlConnection#begin` and terminated with either `io.vertx.mutiny.sqlclient.Transaction#commit` or `io.vertx.mutiny.sqlclient.Transaction#rollback`. All these operations are asynchronous:
ja_jp: リアクティブ SQL クライアントはトランザクションをサポートします。トランザクションは `io.vertx.mutiny.sqlclient.SqlConnection#begin` で開始され、 `io.vertx.mutiny.sqlclient.Transaction#commit` または `io.vertx.mutiny.sqlclient.Transaction#rollback` で終了します。これらの操作はすべて非同期です。

source: The reactive mailer is non-blocking, and the results are provided on an I/O thread. See the xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture documentation] for further details on this topic.
ja_jp: リアクティブ型Mailerはノンブロッキングで、結果はI/Oスレッドで提供されます。このトピックの詳細については、 link:quarkus-reactive-architecture.html[Quarkus Reactive Architectureのドキュメント]を参照してください。

source: The reactive mailer uses Mutiny reactive types. If you are not familiar with Mutiny, check xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library].
ja_jp: リアクティブ MailerはMutiny link:getting-started-reactive#mutiny[リアクティブ型] を使用しています。xref:mutiny-primer.adoc[Mutiny - 直感的リアクティブプログラミングライブラリ] をチェックしてください。

source: The reactive model
ja_jp: リアクティブ・モデル

source: The reactive model uses the hardware resources more efficiently, but... a significant pitfall lurks. If the processing of a request starts to block, things can go south really quickly as no other request can be handled. To avoid this, you need to learn how to write asynchronous and non-blocking code, how to schedule operations, how to write continuations, how to chain actions. Basically, we need a way to structure asynchronous processing, and use non-blocking IO. No doubt, that consists of a paradigm shift. In Quarkus, we want to make the shift as easy as possible, so RESTEasy Reactive allows you to choose whether an endpoint is blocking or non-blocking (an application is free to mix and match blocking and non-blocking methods at will). So don’t be intimidated by the reactive word, the infrastructure is reactive, but your code can be either reactive or imperative. That’s what we mean by unification of reactive and imperative.
ja_jp: リアクティブモデルはハードウェアリソースをより効率的に使用しますが、重大な落とし穴が潜んでいます。もしリクエストの処理がブロックされ始めると、他のリクエストが処理できなくなるため、本当にすぐに事態が悪化してしまいます。これを避けるためには、非同期でノンブロッキングなコードの書き方、操作のスケジュールの立て方、連続処理の書き方、アクションの連鎖の仕方などを学ぶ必要があります。基本的には、非同期処理を構造化し、ノンブロッキングIOを使う方法が必要です。これは間違いなく、パラダイムシフトであることは間違いありません。Quarkusでは、このシフトをできるだけ簡単にしたいと考えているので、RESTEasy Reactiveでは、エンドポイントがブロッキングかノンブロッキングかを選択することができます (アプリケーションはブロッキングとノンブロッキングのメソッドを自由に組み合わせて使用することができます)。インフラストラクチャはリアクティブですが、あなたのコードはリアクティブ型にも命令型にもなり得ます。これが、リアクティブ型と命令型の統一の意味です。

source: The reactive variant of the `Person` class will be:
ja_jp: `Person` クラスのリアクティブ・バリアントは以下のようになります。

source: The reactive variant returns a `Uni<Response>`.
ja_jp: リアクティブバリアントは `Uni<Response>` を返します。

source: The reactive version of that bean, for example `Uni<QuarkusCqlSession>` or `Uni<FruitDao>`.
ja_jp: そのBeanのリアクティブバージョン、例えば `Uni<QuarkusCqlSession>` や `Uni<FruitDao>` など。

source: The read access is limited to the client requests with the `orders_read` scope.
ja_jp: 読み取りアクセスは、 `orders_read` スコープを持つクライアントリクエストに制限されます。

source: The reason `${project.basedir}/.quarkus` directory was chosen as the default location was to make it easy to track build time configuration changes between builds and use that as an indicator to build output caching tools (such as https://maven.apache.org/extensions/maven-build-cache-extension/[Apache Maven Build Cache] and https://gradle.com/gradle-enterprise-solutions/build-cache/[Develocity Build Cache]) whether the application binary has to be re-built.
ja_jp: `${project.basedir}/.quarkus` ディレクトリーがデフォルトの場所として選択された理由は、ビルド時におけるビルド間の設定変更を追跡しやすくするためです。出力キャッシュツール (https://maven.apache.org/extensions/maven-build-cache-extension/[Apache Maven Build Cache] や https://gradle.com/gradle-enterprise-solutions/build-cache/[Develocity Build Cache] など) は、これを指標として使用することで、アプリケーションバイナリーを再構築する必要があるかどうかを判断できます。

source: The reason behind this is that Quarkus needs to juggle with class loading and, due to nature of extension initialization in JUnit, there is limited guarantee as to which extension comes first and when exactly they get instantiated.
ja_jp: この背景には、Quarkus がクラスローディングを調整する必要があることと、JUnit におけるエクステンションの初期化の性質上、どのエクステンションが最初に起動し、いつ正確にインスタンス化されるかについて限定的な保証しかないという理由があります。

source: The reason for 1) is that code needs to be run interpreted for some time and, possibly, to be compiled several times before all potential optimizations are realized to ensure that:
ja_jp: 1)の理由は、コードはしばらくの間、インタプリタ実行する必要があり、場合によっては、以下を担保する全ての潜在的な最適化が実現される前に、何度もコンパイルする必要があるからです。
